# StructuralSectionSigmaProfileTopBendWidth Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralSectionSigmaProfileTopBendWidth Property
ParameterTypeId Class See Also
---
"Top Bend Length"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralSectionSigmaProfileTopBendWidth { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralSectionSigmaProfileTopBendWidth As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralSectionSigmaProfileTopBendWidth {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace